In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\andres c\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\andres c\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\andres c\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 1.4 MB/s eta 0:00:08
   -- ------------------------------------- 0.8/11.5 MB 1.4 MB/s eta 0:00:08
   ---- ----------------------------------- 1.3/11.5 MB 1.7 MB/s eta 0:00:07
   ----- ---------------------------------- 1.6/11.5 MB 1.8 MB/s eta 0:00:06
   -------- ------------------------------- 2.4/11.5 MB 2.0 MB/s eta 0:00:05
   --------- ------------------------------ 2.6/11.5 MB 2.1 MB/s eta 0:00:05
   ---------- ----------------------------- 2.9/11.5 MB 2.0 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.5 MB 1.9 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.5 MB 1.9 MB/s eta 0:00:05
   ------------- -------------------------- 3.9/11.5 MB 1.8 MB/s eta 0:00:05
   -------------- ------------------------- 4.2/11.5 MB 1.8 MB/s eta 0:00:05
   --------------- ------------------------ 4.5/11.5 MB 1.7 MB/s eta 0:00:05
   ----------------- ---------------------- 5.0/11.5 MB 1.7 MB/s eta 0:00:04
   ------------------ --------------------- 5.2/11.5 MB 1.7 MB/s eta 0:00:04
   ------------------- -------------------- 5.5/11.5 MB 1.7 MB/s eta 0:00:04
   -------------------- ------------------- 5.8/11.5 MB 1.7 MB/s eta 0:00:04
   --------------------- ------------------ 6.3/11.5 MB 1.7 MB/s eta 0:00:04
   --------------------- ------------------ 6.3/11.5 MB 1.7 MB/s eta 0:00:04
   ----------------------- ---------------- 6.8/11.5 MB 1.6 MB/s eta 0:00:03
   ------------------------- -------------- 7.3/11.5 MB 1.7 MB/s eta 0:00:03
   --------------------------- ------------ 7.9/11.5 MB 1.7 MB/s eta 0:00:03
   ----------------------------- ---------- 8.4/11.5 MB 1.8 MB/s eta 0:00:02
   ------------------------------ --------- 8.7/11.5 MB 1.8 MB/s eta 0:00:02
   ------------------------------- -------- 9.2/11.5 MB 1.8 MB/s eta 0:00:02
   -------------------------------- ------- 9.4/11.5 MB 1.8 MB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 1.8 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 1.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 1.9 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 1.9 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pandas as pd

In [3]:
import pandas as pd 
import numpy as np 

conos = pd.DataFrame({
    'Sabor': np.array(['mora','vainilla', 'chocolate', 'mora', 'chocolate' ]),
    'precio': np.array([3500, 4700, 6500, 5200, 5700])
})
conos

       Sabor  precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [15]:
conos ['Sabor']

0         mora
1     vainilla
2    chocolate
3         mora
4    chocolate
Name: Sabor, dtype: object

In [17]:
conos['precio']

0    3500
1    4700
2    6500
3    5200
4    5700
Name: precio, dtype: int64

In [5]:
conos[['Sabor','precio']]

       Sabor  precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [39]:
conos[1:3]

       Sabor  precio
1   vainilla    4700
2  chocolate    6500

In [ ]:
conos.sort_values(by='Sabor', ascending=True)#Organice en orden alfabetico True/False orden la orientación

       Sabor  precio
2  chocolate    6500
4  chocolate    5700
0       mora    3500
3       mora    5200
1   vainilla    4700

In [ ]:
conos.head(2) #Veo el comienzo de la estrucutra de arriba hacia abajo

      Sabor  precio
0      mora    3500
1  vainilla    4700

In [48]:
conos.tail(2) #Veo la estrucutura de abajo hacia arriba

       Sabor  precio
3       mora    5200
4  chocolate    5700

In [59]:
conos.sample(1) #Veo un registro al azar

  Sabor  precio
3  mora    5200

In [ ]:
conos.describe() #Entrega todos los datos de abajo

            precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [67]:
conos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sabor   5 non-null      object
 1   precio  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [70]:
conos.index

RangeIndex(start=0, stop=5, step=1)

In [72]:
conos.iloc[3] #entro a la posición especifica que deseo

Sabor     mora
precio    5200
Name: 3, dtype: object

In [88]:
#Seleccione la fila 1 en adelante, la fila 2 a la 4 y las fila 1 y 4.
conos[1:]

       Sabor  precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [91]:
conos[2:5]

       Sabor  precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [92]:
conos.iloc[[1,4]]

       Sabor  precio
1   vainilla    4700
4  chocolate    5700

In [109]:
#Selecciona el precio de la fila 3
conos['precio'][3]
conos.iloc[3,1]

np.int64(5200)

In [113]:
# 1. Los indice con numeros debemos cambiar el indice 
conos_i=conos.set_index('Sabor', inplace=False)
conos_i

           precio
Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700

In [115]:
conos_i.index

Index(['mora', 'vainilla', 'chocolate', 'mora', 'chocolate'], dtype='object', name='Sabor')

In [126]:
conos_i.loc['chocolate'] #Accedemos a indicines no numericos

           precio
Sabor
chocolate    6500
chocolate    5700

In [135]:
conos_i.loc['vainilla','precio'] #Accedemos solo al precio de acuerdo al indice

np.int64(4700)

In [145]:
#Escoger los conos que tienen un precio mayor a 5000
conos[conos['precio'] > 5000] #Se crea una especie de mascara encerrando a conos entre parentesis por que si no aparecen valores boleanos

       Sabor  precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [147]:
conos['precio'] > 5000

0    False
1    False
2     True
3     True
4     True
Name: precio, dtype: bool

In [155]:
#Seleccionar los sabores de precios entre 3 mil y 5 mil. Seleccione los sabores de chocolate con un precio de 5100
conos ['precio'] < 3000

0    False
1    False
2    False
3    False
4    False
Name: precio, dtype: bool